MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334J8UI/mcu.h
/*  Bit definition for HRPWM_PCNBR3 register  */
#define HRPWM_PCNBR3_EXEV1DCB_POS                      (0U)
#define HRPWM_PCNBR3_EXEV1DCB                          (0x00000003UL)
#define HRPWM_PCNBR3_EXEV1DCB_0                        (0x00000001UL)
#define HRPWM_PCNBR3_EXEV1DCB_1                        (0x00000002UL)
#define HRPWM_PCNBR3_EXEV2DCB_POS                      (2U)
#define HRPWM_PCNBR3_EXEV2DCB                          (0x0000000CUL)
#define HRPWM_PCNBR3_EXEV2DCB_0                        (0x00000004UL)
#define HRPWM_PCNBR3_EXEV2DCB_1                        (0x00000008UL)
#define HRPWM_PCNBR3_EXEV3DCB_POS                      (4U)
#define HRPWM_PCNBR3_EXEV3DCB                          (0x00000030UL)
#define HRPWM_PCNBR3_EXEV3DCB_0                        (0x00000010UL)
#define HRPWM_PCNBR3_EXEV3DCB_1                        (0x00000020UL)
#define HRPWM_PCNBR3_EXEV4DCB_POS                      (6U)
#define HRPWM_PCNBR3_EXEV4DCB                          (0x000000C0UL)
#define HRPWM_PCNBR3_EXEV4DCB_0                        (0x00000040UL)
#define HRPWM_PCNBR3_EXEV4DCB_1                        (0x00000080UL)
#define HRPWM_PCNBR3_EXEV5DCB_POS                      (8U)
#define HRPWM_PCNBR3_EXEV5DCB                          (0x00000300UL)
#define HRPWM_PCNBR3_EXEV5DCB_0                        (0x00000100UL)
#define HRPWM_PCNBR3_EXEV5DCB_1                        (0x00000200UL)
#define HRPWM_PCNBR3_EXEV6DCB_POS                      (10U)
#define HRPWM_PCNBR3_EXEV6DCB                          (0x00000C00UL)
#define HRPWM_PCNBR3_EXEV6DCB_0                        (0x00000400UL)
#define HRPWM_PCNBR3_EXEV6DCB_1                        (0x00000800UL)
#define HRPWM_PCNBR3_EXEV7DCB_POS                      (12U)
#define HRPWM_PCNBR3_EXEV7DCB                          (0x00003000UL)
#define HRPWM_PCNBR3_EXEV7DCB_0                        (0x00001000UL)
#define HRPWM_PCNBR3_EXEV7DCB_1                        (0x00002000UL)
#define HRPWM_PCNBR3_EXEV8DCB_POS                      (14U)
#define HRPWM_PCNBR3_EXEV8DCB                          (0x0000C000UL)
#define HRPWM_PCNBR3_EXEV8DCB_0                        (0x00004000UL)
#define HRPWM_PCNBR3_EXEV8DCB_1                        (0x00008000UL)
#define HRPWM_PCNBR3_EXEV9DCB_POS                      (16U)
#define HRPWM_PCNBR3_EXEV9DCB                          (0x00030000UL)
#define HRPWM_PCNBR3_EXEV9DCB_0                        (0x00010000UL)
#define HRPWM_PCNBR3_EXEV9DCB_1                        (0x00020000UL)
#define HRPWM_PCNBR3_EXEV10DCB_POS                     (18U)
#define HRPWM_PCNBR3_EXEV10DCB                         (0x000C0000UL)
#define HRPWM_PCNBR3_EXEV10DCB_0                       (0x00040000UL)
#define HRPWM_PCNBR3_EXEV10DCB_1                       (0x00080000UL)
#define HRPWM_PCNBR3_CMEDCB_POS                        (20U)
#define HRPWM_PCNBR3_CMEDCB                            (0x00300000UL)
#define HRPWM_PCNBR3_CMEDCB_0                          (0x00100000UL)
#define HRPWM_PCNBR3_CMEDCB_1                          (0x00200000UL)
#define HRPWM_PCNBR3_CMFDCB_POS                        (22U)
#define HRPWM_PCNBR3_CMFDCB                            (0x00C00000UL)
#define HRPWM_PCNBR3_CMFDCB_0                          (0x00400000UL)
#define HRPWM_PCNBR3_CMFDCB_1                          (0x00800000UL)
#define HRPWM_PCNBR3_SCMADCB_POS                       (24U)
#define HRPWM_PCNBR3_SCMADCB                           (0x03000000UL)
#define HRPWM_PCNBR3_SCMADCB_0                         (0x01000000UL)
#define HRPWM_PCNBR3_SCMADCB_1                         (0x02000000UL)
#define HRPWM_PCNBR3_SCMBDCB_POS                       (26U)
#define HRPWM_PCNBR3_SCMBDCB                           (0x0C000000UL)
#define HRPWM_PCNBR3_SCMBDCB_0                         (0x04000000UL)
#define HRPWM_PCNBR3_SCMBDCB_1                         (0x08000000UL)

/*  Bit definition for HRPWM_IDLECR register  */
#define HRPWM_IDLECR_IDLEBMA_POS                       (0U)
#define HRPWM_IDLECR_IDLEBMA                           (0x00000001UL)
#define HRPWM_IDLECR_IDLESA_POS                        (1U)
#define HRPWM_IDLECR_IDLESA                            (0x00000002UL)
#define HRPWM_IDLECR_DIDLA_POS                         (2U)
#define HRPWM_IDLECR_DIDLA                             (0x00000004UL)
#define HRPWM_IDLECR_DLYCHA_POS                        (3U)
#define HRPWM_IDLECR_DLYCHA                            (0x00000008UL)
#define HRPWM_IDLECR_DLYPRTEN_POS                      (8U)
#define HRPWM_IDLECR_DLYPRTEN                          (0x00000100UL)
#define HRPWM_IDLECR_DLYEVSEL_POS                      (9U)
#define HRPWM_IDLECR_DLYEVSEL                          (0x00000E00UL)
#define HRPWM_IDLECR_DLYSTRG_POS                       (12U)
#define HRPWM_IDLECR_DLYSTRG                           (0x00001000UL)
#define HRPWM_IDLECR_IDLEBMB_POS                       (16U)
#define HRPWM_IDLECR_IDLEBMB                           (0x00010000UL)
#define HRPWM_IDLECR_IDLESB_POS                        (17U)
#define HRPWM_IDLECR_IDLESB                            (0x00020000UL)
#define HRPWM_IDLECR_DIDLB_POS                         (18U)
#define HRPWM_IDLECR_DIDLB                             (0x00040000UL)
#define HRPWM_IDLECR_DLYCHB_POS                        (19U)
#define HRPWM_IDLECR_DLYCHB                            (0x00080000UL)
#define HRPWM_IDLECR_INTENDLYPRT_POS                   (24U)
#define HRPWM_IDLECR_INTENDLYPRT                       (0x01000000UL)
#define HRPWM_IDLECR_FOLLOW_POS                        (25U)
#define HRPWM_IDLECR_FOLLOW                            (0x02000000UL)

/*  Bit definition for HRPWM_GCONR1 register  */
#define HRPWM_GCONR1_INVCAEN_POS                       (0U)
#define HRPWM_GCONR1_INVCAEN                           (0x00000001UL)
#define HRPWM_GCONR1_INVCBEN_POS                       (1U)
#define HRPWM_GCONR1_INVCBEN                           (0x00000002UL)
#define HRPWM_GCONR1_SWAPEN_POS                        (2U)
#define HRPWM_GCONR1_SWAPEN                            (0x00000004UL)
#define HRPWM_GCONR1_SWAPMD_POS                        (3U)
#define HRPWM_GCONR1_SWAPMD                            (0x00000008UL)
#define HRPWM_GCONR1_HALF_POS                          (4U)
#define HRPWM_GCONR1_HALF                              (0x00000010UL)
#define HRPWM_GCONR1_PRDLK_POS                         (5U)
#define HRPWM_GCONR1_PRDLK                             (0x00000020UL)
#define HRPWM_GCONR1_EEFM_POS                          (6U)
#define HRPWM_GCONR1_EEFM                              (0x00000040UL)
#define HRPWM_GCONR1_EEFREF_POS                        (7U)
#define HRPWM_GCONR1_EEFREF                            (0x00000080UL)
#define HRPWM_GCONR1_PRDSEL_POS                        (9U)
#define HRPWM_GCONR1_PRDSEL                            (0x00000600UL)
#define HRPWM_GCONR1_PRDSEL_0                          (0x00000200UL)
#define HRPWM_GCONR1_PRDSEL_1                          (0x00000400UL)
#define HRPWM_GCONR1_CMSCAUEN_POS                      (16U)
#define HRPWM_GCONR1_CMSCAUEN                          (0x00010000UL)
#define HRPWM_GCONR1_CMSCADEN_POS                      (17U)
#define HRPWM_GCONR1_CMSCADEN                          (0x00020000UL)
#define HRPWM_GCONR1_CMSCBUEN_POS                      (18U)
#define HRPWM_GCONR1_CMSCBUEN                          (0x00040000UL)
#define HRPWM_GCONR1_CMSCBDEN_POS                      (19U)
#define HRPWM_GCONR1_CMSCBDEN                          (0x00080000UL)
#define HRPWM_GCONR1_BFSEL_POS                         (20U)
#define HRPWM_GCONR1_BFSEL                             (0x00F00000UL)

/*  Bit definition for HRPWM_BICONR register  */
#define HRPWM_BICONR_INTENA_POS                        (0U)
#define HRPWM_BICONR_INTENA                            (0x00000001UL)
#define HRPWM_BICONR_INTENB_POS                        (1U)
#define HRPWM_BICONR_INTENB                            (0x00000002UL)
#define HRPWM_BICONR_INTENC_POS                        (2U)
#define HRPWM_BICONR_INTENC                            (0x00000004UL)
#define HRPWM_BICONR_INTEND_POS                        (3U)
#define HRPWM_BICONR_INTEND                            (0x00000008UL)
#define HRPWM_BICONR_INTENE_POS                        (4U)
#define HRPWM_BICONR_INTENE                            (0x00000010UL)
#define HRPWM_BICONR_INTENF_POS                        (5U)
#define HRPWM_BICONR_INTENF                            (0x00000020UL)
#define HRPWM_BICONR_INTENOVF_POS                      (6U)
#define HRPWM_BICONR_INTENOVF                          (0x00000040UL)
#define HRPWM_BICONR_NTENUDF_POS                       (7U)
#define HRPWM_BICONR_NTENUDF                           (0x00000080UL)
#define HRPWM_BICONR_INTENCAPA_POS                     (14U)
#define HRPWM_BICONR_INTENCAPA                         (0x00004000UL)
#define HRPWM_BICONR_INTENCAPB_POS                     (15U)
#define HRPWM_BICONR_INTENCAPB                         (0x00008000UL)
#define HRPWM_BICONR_INTENSAU_POS                      (16U)
#define HRPWM_BICONR_INTENSAU                          (0x00010000UL)
#define HRPWM_BICONR_INTENSAD_POS                      (17U)
#define HRPWM_BICONR_INTENSAD                          (0x00020000UL)
#define HRPWM_BICONR_INTENSBU_POS                      (18U)
#define HRPWM_BICONR_INTENSBU                          (0x00040000UL)
#define HRPWM_BICONR_INTENSBD_POS                      (19U)
#define HRPWM_BICONR_INTENSBD                          (0x00080000UL)

/*  Bit definition for HRPWM_BPCNAR1 register  */
#define HRPWM_BPCNAR1_STACA_POS                        (0U)
#define HRPWM_BPCNAR1_STACA                            (0x00000003UL)
#define HRPWM_BPCNAR1_STACA_0                          (0x00000001UL)
#define HRPWM_BPCNAR1_STACA_1                          (0x00000002UL)
#define HRPWM_BPCNAR1_STPCA_POS                        (2U)
#define HRPWM_BPCNAR1_STPCA                            (0x0000000CUL)
#define HRPWM_BPCNAR1_STPCA_0                          (0x00000004UL)
#define HRPWM_BPCNAR1_STPCA_1                          (0x00000008UL)
#define HRPWM_BPCNAR1_OVFCA_POS                        (4U)
#define HRPWM_BPCNAR1_OVFCA                            (0x00000030UL)
#define HRPWM_BPCNAR1_OVFCA_0                          (0x00000010UL)
#define HRPWM_BPCNAR1_OVFCA_1                          (0x00000020UL)
#define HRPWM_BPCNAR1_UDFCA_POS                        (6U)
#define HRPWM_BPCNAR1_UDFCA                            (0x000000C0UL)
#define HRPWM_BPCNAR1_UDFCA_0                          (0x00000040UL)
#define HRPWM_BPCNAR1_UDFCA_1                          (0x00000080UL)
#define HRPWM_BPCNAR1_CMAUCA_POS                       (8U)
#define HRPWM_BPCNAR1_CMAUCA                           (0x00000300UL)
#define HRPWM_BPCNAR1_CMAUCA_0                         (0x00000100UL)
#define HRPWM_BPCNAR1_CMAUCA_1                         (0x00000200UL)
#define HRPWM_BPCNAR1_CMADCA_POS                       (10U)
#define HRPWM_BPCNAR1_CMADCA                           (0x00000C00UL)
#define HRPWM_BPCNAR1_CMADCA_0                         (0x00000400UL)
#define HRPWM_BPCNAR1_CMADCA_1                         (0x00000800UL)
#define HRPWM_BPCNAR1_CMBUCA_POS                       (12U)
#define HRPWM_BPCNAR1_CMBUCA                           (0x00003000UL)
#define HRPWM_BPCNAR1_CMBUCA_0                         (0x00001000UL)
#define HRPWM_BPCNAR1_CMBUCA_1                         (0x00002000UL)
#define HRPWM_BPCNAR1_CMBDCA_POS                       (14U)
#define HRPWM_BPCNAR1_CMBDCA                           (0x0000C000UL)
#define HRPWM_BPCNAR1_CMBDCA_0                         (0x00004000UL)
#define HRPWM_BPCNAR1_CMBDCA_1                         (0x00008000UL)
#define HRPWM_BPCNAR1_FORCA_POS                        (16U)
#define HRPWM_BPCNAR1_FORCA                            (0x00030000UL)
#define HRPWM_BPCNAR1_FORCA_0                          (0x00010000UL)
#define HRPWM_BPCNAR1_FORCA_1                          (0x00020000UL)
#define HRPWM_BPCNAR1_EMBCA_POS                        (20U)
#define HRPWM_BPCNAR1_EMBCA                            (0x00300000UL)
#define HRPWM_BPCNAR1_EMBCA_0                          (0x00100000UL)
#define HRPWM_BPCNAR1_EMBCA_1                          (0x00200000UL)
#define HRPWM_BPCNAR1_EMBRA_POS                        (22U)
#define HRPWM_BPCNAR1_EMBRA                            (0x00C00000UL)
#define HRPWM_BPCNAR1_EMBRA_0                          (0x00400000UL)
#define HRPWM_BPCNAR1_EMBRA_1                          (0x00800000UL)
#define HRPWM_BPCNAR1_EMBSA_POS                        (24U)
#define HRPWM_BPCNAR1_EMBSA                            (0x07000000UL)
#define HRPWM_BPCNAR1_OUTENA_POS                       (28U)
#define HRPWM_BPCNAR1_OUTENA                           (0x10000000UL)

