MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334J8UI/mcu.h
/*  Bit definition for HRPWM_BPCNBR1 register  */
#define HRPWM_BPCNBR1_STACB_POS                        (0U)
#define HRPWM_BPCNBR1_STACB                            (0x00000003UL)
#define HRPWM_BPCNBR1_STACB_0                          (0x00000001UL)
#define HRPWM_BPCNBR1_STACB_1                          (0x00000002UL)
#define HRPWM_BPCNBR1_STPCB_POS                        (2U)
#define HRPWM_BPCNBR1_STPCB                            (0x0000000CUL)
#define HRPWM_BPCNBR1_STPCB_0                          (0x00000004UL)
#define HRPWM_BPCNBR1_STPCB_1                          (0x00000008UL)
#define HRPWM_BPCNBR1_OVFCB_POS                        (4U)
#define HRPWM_BPCNBR1_OVFCB                            (0x00000030UL)
#define HRPWM_BPCNBR1_OVFCB_0                          (0x00000010UL)
#define HRPWM_BPCNBR1_OVFCB_1                          (0x00000020UL)
#define HRPWM_BPCNBR1_UDFCB_POS                        (6U)
#define HRPWM_BPCNBR1_UDFCB                            (0x000000C0UL)
#define HRPWM_BPCNBR1_UDFCB_0                          (0x00000040UL)
#define HRPWM_BPCNBR1_UDFCB_1                          (0x00000080UL)
#define HRPWM_BPCNBR1_CMAUCB_POS                       (8U)
#define HRPWM_BPCNBR1_CMAUCB                           (0x00000300UL)
#define HRPWM_BPCNBR1_CMAUCB_0                         (0x00000100UL)
#define HRPWM_BPCNBR1_CMAUCB_1                         (0x00000200UL)
#define HRPWM_BPCNBR1_CMADCB_POS                       (10U)
#define HRPWM_BPCNBR1_CMADCB                           (0x00000C00UL)
#define HRPWM_BPCNBR1_CMADCB_0                         (0x00000400UL)
#define HRPWM_BPCNBR1_CMADCB_1                         (0x00000800UL)
#define HRPWM_BPCNBR1_CMBUCB_POS                       (12U)
#define HRPWM_BPCNBR1_CMBUCB                           (0x00003000UL)
#define HRPWM_BPCNBR1_CMBUCB_0                         (0x00001000UL)
#define HRPWM_BPCNBR1_CMBUCB_1                         (0x00002000UL)
#define HRPWM_BPCNBR1_CMBDCB_POS                       (14U)
#define HRPWM_BPCNBR1_CMBDCB                           (0x0000C000UL)
#define HRPWM_BPCNBR1_CMBDCB_0                         (0x00004000UL)
#define HRPWM_BPCNBR1_CMBDCB_1                         (0x00008000UL)
#define HRPWM_BPCNBR1_FORCB_POS                        (16U)
#define HRPWM_BPCNBR1_FORCB                            (0x00030000UL)
#define HRPWM_BPCNBR1_FORCB_0                          (0x00010000UL)
#define HRPWM_BPCNBR1_FORCB_1                          (0x00020000UL)
#define HRPWM_BPCNBR1_EMBCB_POS                        (20U)
#define HRPWM_BPCNBR1_EMBCB                            (0x00300000UL)
#define HRPWM_BPCNBR1_EMBCB_0                          (0x00100000UL)
#define HRPWM_BPCNBR1_EMBCB_1                          (0x00200000UL)
#define HRPWM_BPCNBR1_EMBRB_POS                        (22U)
#define HRPWM_BPCNBR1_EMBRB                            (0x00C00000UL)
#define HRPWM_BPCNBR1_EMBRB_0                          (0x00400000UL)
#define HRPWM_BPCNBR1_EMBRB_1                          (0x00800000UL)
#define HRPWM_BPCNBR1_EMBSB_POS                        (24U)
#define HRPWM_BPCNBR1_EMBSB                            (0x07000000UL)
#define HRPWM_BPCNBR1_OUTENB_POS                       (28U)
#define HRPWM_BPCNBR1_OUTENB                           (0x10000000UL)

/*  Bit definition for HRPWM_BPCNAR2 register  */
#define HRPWM_BPCNAR2_EXEV1UCA_POS                     (0U)
#define HRPWM_BPCNAR2_EXEV1UCA                         (0x00000003UL)
#define HRPWM_BPCNAR2_EXEV1UCA_0                       (0x00000001UL)
#define HRPWM_BPCNAR2_EXEV1UCA_1                       (0x00000002UL)
#define HRPWM_BPCNAR2_EXEV2UCA_POS                     (2U)
#define HRPWM_BPCNAR2_EXEV2UCA                         (0x0000000CUL)
#define HRPWM_BPCNAR2_EXEV2UCA_0                       (0x00000004UL)
#define HRPWM_BPCNAR2_EXEV2UCA_1                       (0x00000008UL)
#define HRPWM_BPCNAR2_EXEV3UCA_POS                     (4U)
#define HRPWM_BPCNAR2_EXEV3UCA                         (0x00000030UL)
#define HRPWM_BPCNAR2_EXEV3UCA_0                       (0x00000010UL)
#define HRPWM_BPCNAR2_EXEV3UCA_1                       (0x00000020UL)
#define HRPWM_BPCNAR2_EXEV4UCA_POS                     (6U)
#define HRPWM_BPCNAR2_EXEV4UCA                         (0x000000C0UL)
#define HRPWM_BPCNAR2_EXEV4UCA_0                       (0x00000040UL)
#define HRPWM_BPCNAR2_EXEV4UCA_1                       (0x00000080UL)
#define HRPWM_BPCNAR2_EXEV5UCA_POS                     (8U)
#define HRPWM_BPCNAR2_EXEV5UCA                         (0x00000300UL)
#define HRPWM_BPCNAR2_EXEV5UCA_0                       (0x00000100UL)
#define HRPWM_BPCNAR2_EXEV5UCA_1                       (0x00000200UL)
#define HRPWM_BPCNAR2_EXEV6UCA_POS                     (10U)
#define HRPWM_BPCNAR2_EXEV6UCA                         (0x00000C00UL)
#define HRPWM_BPCNAR2_EXEV6UCA_0                       (0x00000400UL)
#define HRPWM_BPCNAR2_EXEV6UCA_1                       (0x00000800UL)
#define HRPWM_BPCNAR2_EXEV7UCA_POS                     (12U)
#define HRPWM_BPCNAR2_EXEV7UCA                         (0x00003000UL)
#define HRPWM_BPCNAR2_EXEV7UCA_0                       (0x00001000UL)
#define HRPWM_BPCNAR2_EXEV7UCA_1                       (0x00002000UL)
#define HRPWM_BPCNAR2_EXEV8UCA_POS                     (14U)
#define HRPWM_BPCNAR2_EXEV8UCA                         (0x0000C000UL)
#define HRPWM_BPCNAR2_EXEV8UCA_0                       (0x00004000UL)
#define HRPWM_BPCNAR2_EXEV8UCA_1                       (0x00008000UL)
#define HRPWM_BPCNAR2_EXEV9UCA_POS                     (16U)
#define HRPWM_BPCNAR2_EXEV9UCA                         (0x00030000UL)
#define HRPWM_BPCNAR2_EXEV9UCA_0                       (0x00010000UL)
#define HRPWM_BPCNAR2_EXEV9UCA_1                       (0x00020000UL)
#define HRPWM_BPCNAR2_EXEV10UCA_POS                    (18U)
#define HRPWM_BPCNAR2_EXEV10UCA                        (0x000C0000UL)
#define HRPWM_BPCNAR2_EXEV10UCA_0                      (0x00040000UL)
#define HRPWM_BPCNAR2_EXEV10UCA_1                      (0x00080000UL)
#define HRPWM_BPCNAR2_CMEUCA_POS                       (20U)
#define HRPWM_BPCNAR2_CMEUCA                           (0x00300000UL)
#define HRPWM_BPCNAR2_CMEUCA_0                         (0x00100000UL)
#define HRPWM_BPCNAR2_CMEUCA_1                         (0x00200000UL)
#define HRPWM_BPCNAR2_CMFUCA_POS                       (22U)
#define HRPWM_BPCNAR2_CMFUCA                           (0x00C00000UL)
#define HRPWM_BPCNAR2_CMFUCA_0                         (0x00400000UL)
#define HRPWM_BPCNAR2_CMFUCA_1                         (0x00800000UL)
#define HRPWM_BPCNAR2_SCMAUCA_POS                      (24U)
#define HRPWM_BPCNAR2_SCMAUCA                          (0x03000000UL)
#define HRPWM_BPCNAR2_SCMAUCA_0                        (0x01000000UL)
#define HRPWM_BPCNAR2_SCMAUCA_1                        (0x02000000UL)
#define HRPWM_BPCNAR2_SCMBUCA_POS                      (26U)
#define HRPWM_BPCNAR2_SCMBUCA                          (0x0C000000UL)
#define HRPWM_BPCNAR2_SCMBUCA_0                        (0x04000000UL)
#define HRPWM_BPCNAR2_SCMBUCA_1                        (0x08000000UL)

/*  Bit definition for HRPWM_BPCNBR2 register  */
#define HRPWM_BPCNBR2_EXEV1UCB_POS                     (0U)
#define HRPWM_BPCNBR2_EXEV1UCB                         (0x00000003UL)
#define HRPWM_BPCNBR2_EXEV1UCB_0                       (0x00000001UL)
#define HRPWM_BPCNBR2_EXEV1UCB_1                       (0x00000002UL)
#define HRPWM_BPCNBR2_EXEV2UCB_POS                     (2U)
#define HRPWM_BPCNBR2_EXEV2UCB                         (0x0000000CUL)
#define HRPWM_BPCNBR2_EXEV2UCB_0                       (0x00000004UL)
#define HRPWM_BPCNBR2_EXEV2UCB_1                       (0x00000008UL)
#define HRPWM_BPCNBR2_EXEV3UCB_POS                     (4U)
#define HRPWM_BPCNBR2_EXEV3UCB                         (0x00000030UL)
#define HRPWM_BPCNBR2_EXEV3UCB_0                       (0x00000010UL)
#define HRPWM_BPCNBR2_EXEV3UCB_1                       (0x00000020UL)
#define HRPWM_BPCNBR2_EXEV4UCB_POS                     (6U)
#define HRPWM_BPCNBR2_EXEV4UCB                         (0x000000C0UL)
#define HRPWM_BPCNBR2_EXEV4UCB_0                       (0x00000040UL)
#define HRPWM_BPCNBR2_EXEV4UCB_1                       (0x00000080UL)
#define HRPWM_BPCNBR2_EXEV5UCB_POS                     (8U)
#define HRPWM_BPCNBR2_EXEV5UCB                         (0x00000300UL)
#define HRPWM_BPCNBR2_EXEV5UCB_0                       (0x00000100UL)
#define HRPWM_BPCNBR2_EXEV5UCB_1                       (0x00000200UL)
#define HRPWM_BPCNBR2_EXEV6UCB_POS                     (10U)
#define HRPWM_BPCNBR2_EXEV6UCB                         (0x00000C00UL)
#define HRPWM_BPCNBR2_EXEV6UCB_0                       (0x00000400UL)
#define HRPWM_BPCNBR2_EXEV6UCB_1                       (0x00000800UL)
#define HRPWM_BPCNBR2_EXEV7UCB_POS                     (12U)
#define HRPWM_BPCNBR2_EXEV7UCB                         (0x00003000UL)
#define HRPWM_BPCNBR2_EXEV7UCB_0                       (0x00001000UL)
#define HRPWM_BPCNBR2_EXEV7UCB_1                       (0x00002000UL)
#define HRPWM_BPCNBR2_EXEV8UCB_POS                     (14U)
#define HRPWM_BPCNBR2_EXEV8UCB                         (0x0000C000UL)
#define HRPWM_BPCNBR2_EXEV8UCB_0                       (0x00004000UL)
#define HRPWM_BPCNBR2_EXEV8UCB_1                       (0x00008000UL)
#define HRPWM_BPCNBR2_EXEV9UCB_POS                     (16U)
#define HRPWM_BPCNBR2_EXEV9UCB                         (0x00030000UL)
#define HRPWM_BPCNBR2_EXEV9UCB_0                       (0x00010000UL)
#define HRPWM_BPCNBR2_EXEV9UCB_1                       (0x00020000UL)
#define HRPWM_BPCNBR2_EXEV10UCB_POS                    (18U)
#define HRPWM_BPCNBR2_EXEV10UCB                        (0x000C0000UL)
#define HRPWM_BPCNBR2_EXEV10UCB_0                      (0x00040000UL)
#define HRPWM_BPCNBR2_EXEV10UCB_1                      (0x00080000UL)
#define HRPWM_BPCNBR2_CMEUCB_POS                       (20U)
#define HRPWM_BPCNBR2_CMEUCB                           (0x00300000UL)
#define HRPWM_BPCNBR2_CMEUCB_0                         (0x00100000UL)
#define HRPWM_BPCNBR2_CMEUCB_1                         (0x00200000UL)
#define HRPWM_BPCNBR2_CMFUCB_POS                       (22U)
#define HRPWM_BPCNBR2_CMFUCB                           (0x00C00000UL)
#define HRPWM_BPCNBR2_CMFUCB_0                         (0x00400000UL)
#define HRPWM_BPCNBR2_CMFUCB_1                         (0x00800000UL)
#define HRPWM_BPCNBR2_SCMAUCB_POS                      (24U)
#define HRPWM_BPCNBR2_SCMAUCB                          (0x03000000UL)
#define HRPWM_BPCNBR2_SCMAUCB_0                        (0x01000000UL)
#define HRPWM_BPCNBR2_SCMAUCB_1                        (0x02000000UL)
#define HRPWM_BPCNBR2_SCMBUCB_POS                      (26U)
#define HRPWM_BPCNBR2_SCMBUCB                          (0x0C000000UL)
#define HRPWM_BPCNBR2_SCMBUCB_0                        (0x04000000UL)
#define HRPWM_BPCNBR2_SCMBUCB_1                        (0x08000000UL)

/*  Bit definition for HRPWM_BPCNAR3 register  */
#define HRPWM_BPCNAR3_EXEV1DCA_POS                     (0U)
#define HRPWM_BPCNAR3_EXEV1DCA                         (0x00000003UL)
#define HRPWM_BPCNAR3_EXEV1DCA_0                       (0x00000001UL)
#define HRPWM_BPCNAR3_EXEV1DCA_1                       (0x00000002UL)
#define HRPWM_BPCNAR3_EXEV2DCA_POS                     (2U)
#define HRPWM_BPCNAR3_EXEV2DCA                         (0x0000000CUL)
#define HRPWM_BPCNAR3_EXEV2DCA_0                       (0x00000004UL)
#define HRPWM_BPCNAR3_EXEV2DCA_1                       (0x00000008UL)
#define HRPWM_BPCNAR3_EXEV3DCA_POS                     (4U)
#define HRPWM_BPCNAR3_EXEV3DCA                         (0x00000030UL)
#define HRPWM_BPCNAR3_EXEV3DCA_0                       (0x00000010UL)
#define HRPWM_BPCNAR3_EXEV3DCA_1                       (0x00000020UL)
#define HRPWM_BPCNAR3_EXEV4DCA_POS                     (6U)
#define HRPWM_BPCNAR3_EXEV4DCA                         (0x000000C0UL)
#define HRPWM_BPCNAR3_EXEV4DCA_0                       (0x00000040UL)
#define HRPWM_BPCNAR3_EXEV4DCA_1                       (0x00000080UL)
#define HRPWM_BPCNAR3_EXEV5DCA_POS                     (8U)
#define HRPWM_BPCNAR3_EXEV5DCA                         (0x00000300UL)
#define HRPWM_BPCNAR3_EXEV5DCA_0                       (0x00000100UL)
#define HRPWM_BPCNAR3_EXEV5DCA_1                       (0x00000200UL)
#define HRPWM_BPCNAR3_EXEV6DCA_POS                     (10U)
#define HRPWM_BPCNAR3_EXEV6DCA                         (0x00000C00UL)
#define HRPWM_BPCNAR3_EXEV6DCA_0                       (0x00000400UL)
#define HRPWM_BPCNAR3_EXEV6DCA_1                       (0x00000800UL)
#define HRPWM_BPCNAR3_EXEV7DCA_POS                     (12U)
#define HRPWM_BPCNAR3_EXEV7DCA                         (0x00003000UL)
#define HRPWM_BPCNAR3_EXEV7DCA_0                       (0x00001000UL)
#define HRPWM_BPCNAR3_EXEV7DCA_1                       (0x00002000UL)
#define HRPWM_BPCNAR3_EXEV8DCA_POS                     (14U)
#define HRPWM_BPCNAR3_EXEV8DCA                         (0x0000C000UL)
#define HRPWM_BPCNAR3_EXEV8DCA_0                       (0x00004000UL)
#define HRPWM_BPCNAR3_EXEV8DCA_1                       (0x00008000UL)
#define HRPWM_BPCNAR3_EXEV9DCA_POS                     (16U)
#define HRPWM_BPCNAR3_EXEV9DCA                         (0x00030000UL)
#define HRPWM_BPCNAR3_EXEV9DCA_0                       (0x00010000UL)
#define HRPWM_BPCNAR3_EXEV9DCA_1                       (0x00020000UL)
#define HRPWM_BPCNAR3_EXEV10DCA_POS                    (18U)
#define HRPWM_BPCNAR3_EXEV10DCA                        (0x000C0000UL)
#define HRPWM_BPCNAR3_EXEV10DCA_0                      (0x00040000UL)
#define HRPWM_BPCNAR3_EXEV10DCA_1                      (0x00080000UL)
#define HRPWM_BPCNAR3_CMEDCA_POS                       (20U)
#define HRPWM_BPCNAR3_CMEDCA                           (0x00300000UL)
#define HRPWM_BPCNAR3_CMEDCA_0                         (0x00100000UL)
#define HRPWM_BPCNAR3_CMEDCA_1                         (0x00200000UL)
#define HRPWM_BPCNAR3_CMFDCA_POS                       (22U)
#define HRPWM_BPCNAR3_CMFDCA                           (0x00C00000UL)
#define HRPWM_BPCNAR3_CMFDCA_0                         (0x00400000UL)
#define HRPWM_BPCNAR3_CMFDCA_1                         (0x00800000UL)
#define HRPWM_BPCNAR3_SCMADCA_POS                      (24U)
#define HRPWM_BPCNAR3_SCMADCA                          (0x03000000UL)
#define HRPWM_BPCNAR3_SCMADCA_0                        (0x01000000UL)
#define HRPWM_BPCNAR3_SCMADCA_1                        (0x02000000UL)
#define HRPWM_BPCNAR3_SCMBDCA_POS                      (26U)
#define HRPWM_BPCNAR3_SCMBDCA                          (0x0C000000UL)
#define HRPWM_BPCNAR3_SCMBDCA_0                        (0x04000000UL)
#define HRPWM_BPCNAR3_SCMBDCA_1                        (0x08000000UL)

/*  Bit definition for HRPWM_BPCNBR3 register  */
#define HRPWM_BPCNBR3_EXEV1DCB_POS                     (0U)
#define HRPWM_BPCNBR3_EXEV1DCB                         (0x00000003UL)
#define HRPWM_BPCNBR3_EXEV1DCB_0                       (0x00000001UL)
#define HRPWM_BPCNBR3_EXEV1DCB_1                       (0x00000002UL)
#define HRPWM_BPCNBR3_EXEV2DCB_POS                     (2U)
#define HRPWM_BPCNBR3_EXEV2DCB                         (0x0000000CUL)
#define HRPWM_BPCNBR3_EXEV2DCB_0                       (0x00000004UL)
#define HRPWM_BPCNBR3_EXEV2DCB_1                       (0x00000008UL)
#define HRPWM_BPCNBR3_EXEV3DCB_POS                     (4U)
#define HRPWM_BPCNBR3_EXEV3DCB                         (0x00000030UL)
#define HRPWM_BPCNBR3_EXEV3DCB_0                       (0x00000010UL)
#define HRPWM_BPCNBR3_EXEV3DCB_1                       (0x00000020UL)
#define HRPWM_BPCNBR3_EXEV4DCB_POS                     (6U)
#define HRPWM_BPCNBR3_EXEV4DCB                         (0x000000C0UL)
#define HRPWM_BPCNBR3_EXEV4DCB_0                       (0x00000040UL)
#define HRPWM_BPCNBR3_EXEV4DCB_1                       (0x00000080UL)
#define HRPWM_BPCNBR3_EXEV5DCB_POS                     (8U)
#define HRPWM_BPCNBR3_EXEV5DCB                         (0x00000300UL)
#define HRPWM_BPCNBR3_EXEV5DCB_0                       (0x00000100UL)
#define HRPWM_BPCNBR3_EXEV5DCB_1                       (0x00000200UL)
#define HRPWM_BPCNBR3_EXEV6DCB_POS                     (10U)
#define HRPWM_BPCNBR3_EXEV6DCB                         (0x00000C00UL)
#define HRPWM_BPCNBR3_EXEV6DCB_0                       (0x00000400UL)
#define HRPWM_BPCNBR3_EXEV6DCB_1                       (0x00000800UL)
#define HRPWM_BPCNBR3_EXEV7DCB_POS                     (12U)
#define HRPWM_BPCNBR3_EXEV7DCB                         (0x00003000UL)
#define HRPWM_BPCNBR3_EXEV7DCB_0                       (0x00001000UL)
#define HRPWM_BPCNBR3_EXEV7DCB_1                       (0x00002000UL)
#define HRPWM_BPCNBR3_EXEV8DCB_POS                     (14U)
#define HRPWM_BPCNBR3_EXEV8DCB                         (0x0000C000UL)
#define HRPWM_BPCNBR3_EXEV8DCB_0                       (0x00004000UL)
#define HRPWM_BPCNBR3_EXEV8DCB_1                       (0x00008000UL)
#define HRPWM_BPCNBR3_EXEV9DCB_POS                     (16U)
#define HRPWM_BPCNBR3_EXEV9DCB                         (0x00030000UL)
#define HRPWM_BPCNBR3_EXEV9DCB_0                       (0x00010000UL)
#define HRPWM_BPCNBR3_EXEV9DCB_1                       (0x00020000UL)
#define HRPWM_BPCNBR3_EXEV10DCB_POS                    (18U)
#define HRPWM_BPCNBR3_EXEV10DCB                        (0x000C0000UL)
#define HRPWM_BPCNBR3_EXEV10DCB_0                      (0x00040000UL)
#define HRPWM_BPCNBR3_EXEV10DCB_1                      (0x00080000UL)
#define HRPWM_BPCNBR3_CMEDCB_POS                       (20U)
#define HRPWM_BPCNBR3_CMEDCB                           (0x00300000UL)
#define HRPWM_BPCNBR3_CMEDCB_0                         (0x00100000UL)
#define HRPWM_BPCNBR3_CMEDCB_1                         (0x00200000UL)
#define HRPWM_BPCNBR3_CMFDCB_POS                       (22U)
#define HRPWM_BPCNBR3_CMFDCB                           (0x00C00000UL)
#define HRPWM_BPCNBR3_CMFDCB_0                         (0x00400000UL)
#define HRPWM_BPCNBR3_CMFDCB_1                         (0x00800000UL)
#define HRPWM_BPCNBR3_SCMADCB_POS                      (24U)
#define HRPWM_BPCNBR3_SCMADCB                          (0x03000000UL)
#define HRPWM_BPCNBR3_SCMADCB_0                        (0x01000000UL)
#define HRPWM_BPCNBR3_SCMADCB_1                        (0x02000000UL)
#define HRPWM_BPCNBR3_SCMBDCB_POS                      (26U)
#define HRPWM_BPCNBR3_SCMBDCB                          (0x0C000000UL)
#define HRPWM_BPCNBR3_SCMBDCB_0                        (0x04000000UL)
#define HRPWM_BPCNBR3_SCMBDCB_1                        (0x08000000UL)

/*  Bit definition for HRPWM_BGCONR1 register  */
#define HRPWM_BGCONR1_INVCAEN_POS                      (0U)
#define HRPWM_BGCONR1_INVCAEN                          (0x00000001UL)
#define HRPWM_BGCONR1_INVCBEN_POS                      (1U)
#define HRPWM_BGCONR1_INVCBEN                          (0x00000002UL)
#define HRPWM_BGCONR1_SWAPEN_POS                       (2U)
#define HRPWM_BGCONR1_SWAPEN                           (0x00000004UL)
#define HRPWM_BGCONR1_SWAPMD_POS                       (3U)
#define HRPWM_BGCONR1_SWAPMD                           (0x00000008UL)
#define HRPWM_BGCONR1_HALF_POS                         (4U)
#define HRPWM_BGCONR1_HALF                             (0x00000010UL)
#define HRPWM_BGCONR1_PRDLK_POS                        (5U)
#define HRPWM_BGCONR1_PRDLK                            (0x00000020UL)
#define HRPWM_BGCONR1_EEFM_POS                         (6U)
#define HRPWM_BGCONR1_EEFM                             (0x00000040UL)
#define HRPWM_BGCONR1_EEFREF_POS                       (7U)
#define HRPWM_BGCONR1_EEFREF                           (0x00000080UL)
#define HRPWM_BGCONR1_PRDSEL_POS                       (9U)
#define HRPWM_BGCONR1_PRDSEL                           (0x00000600UL)
#define HRPWM_BGCONR1_PRDSEL_0                         (0x00000200UL)
#define HRPWM_BGCONR1_PRDSEL_1                         (0x00000400UL)
#define HRPWM_BGCONR1_CMSCAUEN_POS                     (16U)
#define HRPWM_BGCONR1_CMSCAUEN                         (0x00010000UL)
#define HRPWM_BGCONR1_CMSCADEN_POS                     (17U)
#define HRPWM_BGCONR1_CMSCADEN                         (0x00020000UL)
#define HRPWM_BGCONR1_CMSCBUEN_POS                     (18U)
#define HRPWM_BGCONR1_CMSCBUEN                         (0x00040000UL)
#define HRPWM_BGCONR1_CMSCBDEN_POS                     (19U)
#define HRPWM_BGCONR1_CMSCBDEN                         (0x00080000UL)
#define HRPWM_BGCONR1_BFSEL_POS                        (20U)
#define HRPWM_BGCONR1_BFSEL                            (0x00F00000UL)

/*  Bit definition for HRPWM_SCMASELR register  */
#define HRPWM_SCMASELR_CMSA1_POS                       (0U)
#define HRPWM_SCMASELR_CMSA1                           (0x00000001UL)
#define HRPWM_SCMASELR_CMSB1_POS                       (1U)
#define HRPWM_SCMASELR_CMSB1                           (0x00000002UL)
#define HRPWM_SCMASELR_OVF1_POS                        (2U)
#define HRPWM_SCMASELR_OVF1                            (0x00000004UL)
#define HRPWM_SCMASELR_UDF1_POS                        (3U)
#define HRPWM_SCMASELR_UDF1                            (0x00000008UL)
#define HRPWM_SCMASELR_CMSA2_POS                       (4U)
#define HRPWM_SCMASELR_CMSA2                           (0x00000010UL)
#define HRPWM_SCMASELR_CMSB2_POS                       (5U)
#define HRPWM_SCMASELR_CMSB2                           (0x00000020UL)
#define HRPWM_SCMASELR_OVF2_POS                        (6U)
#define HRPWM_SCMASELR_OVF2                            (0x00000040UL)
#define HRPWM_SCMASELR_UDF2_POS                        (7U)
#define HRPWM_SCMASELR_UDF2                            (0x00000080UL)
#define HRPWM_SCMASELR_CMSA3_POS                       (8U)
#define HRPWM_SCMASELR_CMSA3                           (0x00000100UL)
#define HRPWM_SCMASELR_CMSB3_POS                       (9U)
#define HRPWM_SCMASELR_CMSB3                           (0x00000200UL)
#define HRPWM_SCMASELR_OVF3_POS                        (10U)
#define HRPWM_SCMASELR_OVF3                            (0x00000400UL)
#define HRPWM_SCMASELR_UDF3_POS                        (11U)
#define HRPWM_SCMASELR_UDF3                            (0x00000800UL)
#define HRPWM_SCMASELR_CMSA4_POS                       (12U)
#define HRPWM_SCMASELR_CMSA4                           (0x00001000UL)
#define HRPWM_SCMASELR_CMSB4_POS                       (13U)
#define HRPWM_SCMASELR_CMSB4                           (0x00002000UL)
#define HRPWM_SCMASELR_OVF4_POS                        (14U)
#define HRPWM_SCMASELR_OVF4                            (0x00004000UL)
#define HRPWM_SCMASELR_UDF4_POS                        (15U)
#define HRPWM_SCMASELR_UDF4                            (0x00008000UL)
#define HRPWM_SCMASELR_CMSA5_POS                       (16U)
#define HRPWM_SCMASELR_CMSA5                           (0x00010000UL)
#define HRPWM_SCMASELR_CMSB5_POS                       (17U)
#define HRPWM_SCMASELR_CMSB5                           (0x00020000UL)
#define HRPWM_SCMASELR_OVF5_POS                        (18U)
#define HRPWM_SCMASELR_OVF5                            (0x00040000UL)
#define HRPWM_SCMASELR_UDF5_POS                        (19U)
#define HRPWM_SCMASELR_UDF5                            (0x00080000UL)
#define HRPWM_SCMASELR_CMSA6_POS                       (20U)
#define HRPWM_SCMASELR_CMSA6                           (0x00100000UL)
#define HRPWM_SCMASELR_CMSB6_POS                       (21U)
#define HRPWM_SCMASELR_CMSB6                           (0x00200000UL)
#define HRPWM_SCMASELR_OVF6_POS                        (22U)
#define HRPWM_SCMASELR_OVF6                            (0x00400000UL)
#define HRPWM_SCMASELR_UDF6_POS                        (23U)
#define HRPWM_SCMASELR_UDF6                            (0x00800000UL)
#define HRPWM_SCMASELR_EEVDET_POS                      (24U)
#define HRPWM_SCMASELR_EEVDET                          (0x01000000UL)

