MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334J8UI/mcu.h
/*******************************************************************************
                Bit definition for Peripheral TMR6_COMMON
*******************************************************************************/
/*  Bit definition for TMR6_COMMON_FCNTR register  */
#define TMR6_COMMON_FCNTR_NOFIENTA_POS                 (0U)
#define TMR6_COMMON_FCNTR_NOFIENTA                     (0x00000001UL)
#define TMR6_COMMON_FCNTR_NOFICKTA_POS                 (1U)
#define TMR6_COMMON_FCNTR_NOFICKTA                     (0x00000006UL)
#define TMR6_COMMON_FCNTR_NOFICKTA_0                   (0x00000002UL)
#define TMR6_COMMON_FCNTR_NOFICKTA_1                   (0x00000004UL)
#define TMR6_COMMON_FCNTR_NOFIENTB_POS                 (4U)
#define TMR6_COMMON_FCNTR_NOFIENTB                     (0x00000010UL)
#define TMR6_COMMON_FCNTR_NOFICKTB_POS                 (5U)
#define TMR6_COMMON_FCNTR_NOFICKTB                     (0x00000060UL)
#define TMR6_COMMON_FCNTR_NOFICKTB_0                   (0x00000020UL)
#define TMR6_COMMON_FCNTR_NOFICKTB_1                   (0x00000040UL)
#define TMR6_COMMON_FCNTR_NOFIENTC_POS                 (8U)
#define TMR6_COMMON_FCNTR_NOFIENTC                     (0x00000100UL)
#define TMR6_COMMON_FCNTR_NOFICKTC_POS                 (9U)
#define TMR6_COMMON_FCNTR_NOFICKTC                     (0x00000600UL)
#define TMR6_COMMON_FCNTR_NOFICKTC_0                   (0x00000200UL)
#define TMR6_COMMON_FCNTR_NOFICKTC_1                   (0x00000400UL)
#define TMR6_COMMON_FCNTR_NOFIENTD_POS                 (12U)
#define TMR6_COMMON_FCNTR_NOFIENTD                     (0x00001000UL)
#define TMR6_COMMON_FCNTR_NOFICKTD_POS                 (13U)
#define TMR6_COMMON_FCNTR_NOFICKTD                     (0x00006000UL)
#define TMR6_COMMON_FCNTR_NOFICKTD_0                   (0x00002000UL)
#define TMR6_COMMON_FCNTR_NOFICKTD_1                   (0x00004000UL)

/*  Bit definition for TMR6_COMMON_SSTAR register  */
#define TMR6_COMMON_SSTAR_SSTA1_POS                    (0U)
#define TMR6_COMMON_SSTAR_SSTA1                        (0x00000001UL)
#define TMR6_COMMON_SSTAR_SSTA2_POS                    (1U)
#define TMR6_COMMON_SSTAR_SSTA2                        (0x00000002UL)
#define TMR6_COMMON_SSTAR_SSTA3_POS                    (2U)
#define TMR6_COMMON_SSTAR_SSTA3                        (0x00000004UL)
#define TMR6_COMMON_SSTAR_SSTA4_POS                    (3U)
#define TMR6_COMMON_SSTAR_SSTA4                        (0x00000008UL)

/*  Bit definition for TMR6_COMMON_SSTPR register  */
#define TMR6_COMMON_SSTPR_SSTP1_POS                    (0U)
#define TMR6_COMMON_SSTPR_SSTP1                        (0x00000001UL)
#define TMR6_COMMON_SSTPR_SSTP2_POS                    (1U)
#define TMR6_COMMON_SSTPR_SSTP2                        (0x00000002UL)
#define TMR6_COMMON_SSTPR_SSTP3_POS                    (2U)
#define TMR6_COMMON_SSTPR_SSTP3                        (0x00000004UL)
#define TMR6_COMMON_SSTPR_SSTP4_POS                    (3U)
#define TMR6_COMMON_SSTPR_SSTP4                        (0x00000008UL)

/*  Bit definition for TMR6_COMMON_SCLRR register  */
#define TMR6_COMMON_SCLRR_SCLE1_POS                    (0U)
#define TMR6_COMMON_SCLRR_SCLE1                        (0x00000001UL)
#define TMR6_COMMON_SCLRR_SCLE2_POS                    (1U)
#define TMR6_COMMON_SCLRR_SCLE2                        (0x00000002UL)
#define TMR6_COMMON_SCLRR_SCLE3_POS                    (2U)
#define TMR6_COMMON_SCLRR_SCLE3                        (0x00000004UL)
#define TMR6_COMMON_SCLRR_SCLE4_POS                    (3U)
#define TMR6_COMMON_SCLRR_SCLE4                        (0x00000008UL)

/*  Bit definition for TMR6_COMMON_SUPDR register  */
#define TMR6_COMMON_SUPDR_SUPD1_POS                    (0U)
#define TMR6_COMMON_SUPDR_SUPD1                        (0x00000001UL)
#define TMR6_COMMON_SUPDR_SUPD2_POS                    (1U)
#define TMR6_COMMON_SUPDR_SUPD2                        (0x00000002UL)
#define TMR6_COMMON_SUPDR_SUPD3_POS                    (2U)
#define TMR6_COMMON_SUPDR_SUPD3                        (0x00000004UL)
#define TMR6_COMMON_SUPDR_SUPD4_POS                    (3U)
#define TMR6_COMMON_SUPDR_SUPD4                        (0x00000008UL)

/*******************************************************************************
                Bit definition for Peripheral TMRA
*******************************************************************************/
/*  Bit definition for TMRA_CNTER register  */
#define TMRA_CNTER_CNT                                 (0xFFFFFFFFUL)

/*  Bit definition for TMRA_PERAR register  */
#define TMRA_PERAR_PER                                 (0xFFFFFFFFUL)

/*  Bit definition for TMRA_CMPAR register  */
#define TMRA_CMPAR_CMP                                 (0xFFFFFFFFUL)

/*  Bit definition for TMRA_BCSTRL register  */
#define TMRA_BCSTRL_START_POS                          (0U)
#define TMRA_BCSTRL_START                              (0x01U)
#define TMRA_BCSTRL_DIR_POS                            (1U)
#define TMRA_BCSTRL_DIR                                (0x02U)
#define TMRA_BCSTRL_MODE_POS                           (2U)
#define TMRA_BCSTRL_MODE                               (0x04U)
#define TMRA_BCSTRL_SYNST_POS                          (3U)
#define TMRA_BCSTRL_SYNST                              (0x08U)
#define TMRA_BCSTRL_CKDIV_POS                          (4U)
#define TMRA_BCSTRL_CKDIV                              (0xF0U)

/*  Bit definition for TMRA_BCSTRH register  */
#define TMRA_BCSTRH_OVSTP_POS                          (0U)
#define TMRA_BCSTRH_OVSTP                              (0x01U)
#define TMRA_BCSTRH_ITENOVF_POS                        (4U)
#define TMRA_BCSTRH_ITENOVF                            (0x10U)
#define TMRA_BCSTRH_ITENUDF_POS                        (5U)
#define TMRA_BCSTRH_ITENUDF                            (0x20U)
#define TMRA_BCSTRH_OVFF_POS                           (6U)
#define TMRA_BCSTRH_OVFF                               (0x40U)
#define TMRA_BCSTRH_UDFF_POS                           (7U)
#define TMRA_BCSTRH_UDFF                               (0x80U)

