MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334J8UI/mcu.h
typedef struct {
    __I  uint32_t CF0;
    __I  uint32_t CF1;
    __I  uint32_t CF2;
    __I  uint32_t CF3;
    __I  uint32_t CF4;
    __I  uint32_t CF5;
    __I  uint32_t CF6;
    __I  uint32_t CF7;
    __I  uint32_t CF8;
    __I  uint32_t CF9;
    __I  uint32_t CF10;
    __I  uint32_t CF11;
    __I  uint32_t CF12;
    __I  uint32_t CF13;
    __I  uint32_t CF14;
    __I  uint32_t CF15;
    __I  uint32_t CF16;
    __I  uint32_t CF17;
    __I  uint32_t CF18;
    __I  uint32_t CF19;
    __I  uint32_t CF20;
    __I  uint32_t CF21;
    __I  uint32_t CF22;
    __I  uint32_t CF23;
    __I  uint32_t CF24;
    __I  uint32_t CF25;
    __I  uint32_t CF26;
    __I  uint32_t CF27;
    __I  uint32_t CF28;
    __I  uint32_t CF29;
    __I  uint32_t CF30;
    __I  uint32_t CF31;
} stc_mcan_txbcf_bit_t;

typedef struct {
    __IO uint32_t TIE0;
    __IO uint32_t TIE1;
    __IO uint32_t TIE2;
    __IO uint32_t TIE3;
    __IO uint32_t TIE4;
    __IO uint32_t TIE5;
    __IO uint32_t TIE6;
    __IO uint32_t TIE7;
    __IO uint32_t TIE8;
    __IO uint32_t TIE9;
    __IO uint32_t TIE10;
    __IO uint32_t TIE11;
    __IO uint32_t TIE12;
    __IO uint32_t TIE13;
    __IO uint32_t TIE14;
    __IO uint32_t TIE15;
    __IO uint32_t TIE16;
    __IO uint32_t TIE17;
    __IO uint32_t TIE18;
    __IO uint32_t TIE19;
    __IO uint32_t TIE20;
    __IO uint32_t TIE21;
    __IO uint32_t TIE22;
    __IO uint32_t TIE23;
    __IO uint32_t TIE24;
    __IO uint32_t TIE25;
    __IO uint32_t TIE26;
    __IO uint32_t TIE27;
    __IO uint32_t TIE28;
    __IO uint32_t TIE29;
    __IO uint32_t TIE30;
    __IO uint32_t TIE31;
} stc_mcan_txbtie_bit_t;

typedef struct {
    __IO uint32_t CFIE0;
    __IO uint32_t CFIE1;
    __IO uint32_t CFIE2;
    __IO uint32_t CFIE3;
    __IO uint32_t CFIE4;
    __IO uint32_t CFIE5;
    __IO uint32_t CFIE6;
    __IO uint32_t CFIE7;
    __IO uint32_t CFIE8;
    __IO uint32_t CFIE9;
    __IO uint32_t CFIE10;
    __IO uint32_t CFIE11;
    __IO uint32_t CFIE12;
    __IO uint32_t CFIE13;
    __IO uint32_t CFIE14;
    __IO uint32_t CFIE15;
    __IO uint32_t CFIE16;
    __IO uint32_t CFIE17;
    __IO uint32_t CFIE18;
    __IO uint32_t CFIE19;
    __IO uint32_t CFIE20;
    __IO uint32_t CFIE21;
    __IO uint32_t CFIE22;
    __IO uint32_t CFIE23;
    __IO uint32_t CFIE24;
    __IO uint32_t CFIE25;
    __IO uint32_t CFIE26;
    __IO uint32_t CFIE27;
    __IO uint32_t CFIE28;
    __IO uint32_t CFIE29;
    __IO uint32_t CFIE30;
    __IO uint32_t CFIE31;
} stc_mcan_txbcie_bit_t;

typedef struct {
    uint32_t RESERVED0[24];
    __I  uint32_t EFF;
    __I  uint32_t TEFL;
    uint32_t RESERVED1[6];
} stc_mcan_txefs_bit_t;

typedef struct {
    __IO uint32_t RAM_1ERR;
    __IO uint32_t RAM_2ERR;
    uint32_t RESERVED0[30];
} stc_mcanram_cksr_bit_t;

typedef struct {
    __IO uint32_t EIEN;
    uint32_t RESERVED0[31];
} stc_mcanram_eien_bit_t;

typedef struct {
    __I  uint32_t SMPU1EAF;
    __I  uint32_t PSPEF;
    __I  uint32_t MSPEF;
    uint32_t RESERVED0[29];
} stc_mpu_sr_bit_t;

typedef struct {
    __O  uint32_t SMPU1ECLR;
    __O  uint32_t PSPECLR;
    __O  uint32_t MSPECLR;
    uint32_t RESERVED0[29];
} stc_mpu_eclr_bit_t;

typedef struct {
    __IO uint32_t MPUWE;
    uint32_t RESERVED0[31];
} stc_mpu_wp_bit_t;

typedef struct {
    uint32_t RESERVED0[6];
    __IO uint32_t CRCRDP;
    __IO uint32_t CRCWRP;
    __IO uint32_t EFMRDP;
    __IO uint32_t EFMWRP;
    uint32_t RESERVED1[2];
    __IO uint32_t WDTRDP;
    __IO uint32_t WDTWRP;
    __IO uint32_t SWDTRDP;
    __IO uint32_t SWDTWRP;
    __IO uint32_t BKSRAMRDP;
    __IO uint32_t BKSRAMWRP;
    __IO uint32_t RTCRDP;
    __IO uint32_t RTCWRP;
    __IO uint32_t DMPURDP;
    __IO uint32_t DMPUWRP;
    __IO uint32_t SRAMCRDP;
    __IO uint32_t SRAMCWRP;
    __IO uint32_t INTCRDP;
    __IO uint32_t INTCWRP;
    __IO uint32_t SYSCRDP;
    __IO uint32_t SYSCWRP;
    __IO uint32_t MSTPRDP;
    __IO uint32_t MSPTWRP;
    uint32_t RESERVED2[1];
    __IO uint32_t BUSERRE;
} stc_mpu_ippr_bit_t;

typedef struct {
    uint32_t RESERVED0[30];
    __IO uint32_t MSPPACT;
    __IO uint32_t MSPPE;
} stc_mpu_msppctl_bit_t;

typedef struct {
    uint32_t RESERVED0[30];
    __IO uint32_t PSPPACT;
    __IO uint32_t PSPPE;
} stc_mpu_psppctl_bit_t;

typedef struct {
    __IO uint32_t RG0E;
    __IO uint32_t RG1E;
    __IO uint32_t RG2E;
    __IO uint32_t RG3E;
    __IO uint32_t RG4E;
    __IO uint32_t RG5E;
    __IO uint32_t RG6E;
    __IO uint32_t RG7E;
    __IO uint32_t RG8E;
    __IO uint32_t RG9E;
    __IO uint32_t RG10E;
    __IO uint32_t RG11E;
    __IO uint32_t RG12E;
    __IO uint32_t RG13E;
    __IO uint32_t RG14E;
    __IO uint32_t RG15E;
    uint32_t RESERVED0[16];
} stc_mpu_srge_bit_t;

typedef struct {
    __IO uint32_t RG0WP;
    __IO uint32_t RG1WP;
    __IO uint32_t RG2WP;
    __IO uint32_t RG3WP;
    __IO uint32_t RG4WP;
    __IO uint32_t RG5WP;
    __IO uint32_t RG6WP;
    __IO uint32_t RG7WP;
    __IO uint32_t RG8WP;
    __IO uint32_t RG9WP;
    __IO uint32_t RG10WP;
    __IO uint32_t RG11WP;
    __IO uint32_t RG12WP;
    __IO uint32_t RG13WP;
    __IO uint32_t RG14WP;
    __IO uint32_t RG15WP;
    uint32_t RESERVED0[16];
} stc_mpu_srgwp_bit_t;

typedef struct {
    __IO uint32_t RG0RP;
    __IO uint32_t RG1RP;
    __IO uint32_t RG2RP;
    __IO uint32_t RG3RP;
    __IO uint32_t RG4RP;
    __IO uint32_t RG5RP;
    __IO uint32_t RG6RP;
    __IO uint32_t RG7RP;
    __IO uint32_t RG8RP;
    __IO uint32_t RG9RP;
    __IO uint32_t RG10RP;
    __IO uint32_t RG11RP;
    __IO uint32_t RG12RP;
    __IO uint32_t RG13RP;
    __IO uint32_t RG14RP;
    __IO uint32_t RG15RP;
    uint32_t RESERVED0[16];
} stc_mpu_srgrp_bit_t;

typedef struct {
    __IO uint32_t SMPUBRP;
    __IO uint32_t SMPUBWP;
    uint32_t RESERVED0[5];
    __IO uint32_t SMPUE;
    uint32_t RESERVED1[24];
} stc_mpu_scr_bit_t;

typedef struct {
    __IO uint32_t TMR0U1A;
    __IO uint32_t TMR0U1B;
    __IO uint32_t TMR0U2A;
    __IO uint32_t TMR0U2B;
    __IO uint32_t TMR4U1;
    uint32_t RESERVED0[3];
    __IO uint32_t TMR6U1;
    __IO uint32_t TMR6U2;
    __IO uint32_t TMR6U3;
    __IO uint32_t TMR6U4;
    uint32_t RESERVED1[4];
    __IO uint32_t TMRAU1;
    __IO uint32_t TMRAU2;
    __IO uint32_t TMRAU3;
    __IO uint32_t TMRAU4;
    __IO uint32_t TMRAU5;
    uint32_t RESERVED2[3];
    __IO uint32_t HRPWMU1;
    __IO uint32_t HRPWMU2;
    __IO uint32_t HRPWMU3;
    __IO uint32_t HRPWMU4;
    __IO uint32_t HRPWMU5;
    __IO uint32_t HRPWMU6;
    uint32_t RESERVED3[2];
} stc_peric_tmr_synenr_bit_t;

